Revit 2027 API
PanelScheduleView.GetLoadClassificationConnectedLoad Method
 Gets the Total Load for given Load Classification
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLoadClassificationConnectedLoad(
	int nRow,
	int nCol
)
Public Function GetLoadClassificationConnectedLoad (
	nRow As Integer,
	nCol As Integer
) As String
public:
String^ GetLoadClassificationConnectedLoad(
	int nRow,
	int nCol
)
member GetLoadClassificationConnectedLoad :
        nRow : int *
        nCol : int -> string
Parameters
nRow Int32
 Row number of Load Summary Section
nCol Int32
 Column number of Load Summary Section
Return Value
String
 The total load for the given Load Classification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace